{
    "posts": [
        {
        "title": "Kdo jsem",
        "content": "Jmenuji se Jaromír Ihln a jsem zapálený devloper v C#. Mezi mé další jazyky a frameworky patří HTML, CSS, JavaScript, T-SQL, MSSQL, React, NodeJS a trochu také TypeScript, Python, PHP. V současné době se věnuji vývoji webových aplikací v ASP.NET Core MVC a Blazor. Mám také zkušenosti s databázemi jako je MS SQL Server, SQL-lite MongoDB a PostgreSQL. V nedávné době jsem úspěšně získal akreditaci pro vývoj Web aplikací v ASP.NET Core a React na ITnetwork.cz, což je pro mě velký krok vpřed v mé kariéře. Mým cílem je stát se odborníkem v oblasti vývoje webových aplikací a přispět k inovacím v této oblasti. Nyní jsem se dokonce pustil i jiným směrem jako přispěvatel do Visual Studio Code, kde jsem vytvořil rozšíření pro podporu zvíraznění syntaxe jazyka GAS (Google Apps Script) v tomto editoru. <a href='https://marketplace.visualstudio.com/items?itemName=JaromrIhln.gas-syntax-highlighting'> spolu s vestavěnými úryvky(snippets) pro snadný start stímto jazykem ve vsce pomocí rozšíření 'clasp', které přenáší změny na 'Google sheets'<span class='fa fa-globe'> </span></a>."
        },
        {
        "title": "Co dělám?",
        "content": "Věnuji se vývoji aplikací v C# ASP.NET (MVC, Blazor, Razor...). V současné době se snažím rozvíjet své dovednosti v oblasti webového vývoje a databázových systémů studiem 'PRO full stack' kurzu na ITnetwork.cz, který jsem úspěšně zakončil zkouškou 12.9.2025 v Praze. Do té doby jsem vytvořil samostatně full-stack projekt 'Invoices' ASP.NET Core API(server) a React app jako klientskou aplikaci, kde 30% projektu byl 'starter pack' od ITnetwork. Mým cílem je stát se plněhodnotným vývojářem v oblasti vývoje webových aplikací a přispět k inovacím v této oblasti a své zkušenosti opět přenášet na začínající vývojáře."
        },
        {
        "title": "Nějaké ukázky pro zábavu.",
        "content": "Ukázky mé práce naleznete (odkazy) na stránce s referencemi &#128513;. Mám též ještě jeden web, který je zaměřený na podělení se o mé znalosti a dovednosti v oblasti programování a webového vývoje. postupně zde vkládám články a základní návody v oblasti C#, ale též i ASM, C, C++, ale je to trochu náročnější na čas.<a href='https://whitespaceexperince.eu.'>Whitespace Experience <span class='fa fa-globe'> </span></a>. Jedná se o klasický WordPress &#129488. další mou doménou je <a href='https://www.jiwebmaster.cz/'>jiwebmaster <span class='fa fa-globe'> </span></a>, kde mám svůj blog, portfolio a dokumentaci k právě publikovaným rozšířením pro VS Code na <a href='https://marketplace.visualstudio.com/publishers/JaromrIhln'>Visual Studio Marketplace <span class='fa fa-globe'> </span></a>. &#128526; Samozřejmě nesmí chybět GitHub, kde najdete některé z mých 'public' projektů a kódů. <a href='https://github.com/JaromirIhln'>GitHub <span class='fa fa-github'> </span></a>."
        }
    ]
}