{
    "posts": [
        {
        "title": "Reference a certifikace",
        "content": "Jsem na půl cesty, ale už mám nějaké zkušenosti s vývojem aplikací v C# ASP.NET (MVC, Blazor, Razor...), NodeJS, React, JavaScript, HTML, CSS, Bootstrap. Z těchto jazyků mám certifikace, které jsou k nahlédnutí na <a href='https://www.linkedin.com/in/jaromir-ihln-70129b59/'> Certifikáty <span class='fa fa-certificate'></span></a> . V současné době jsem rozšířil své dovednosti v oblasti webového vývoje studiem 'PRO full stack' kurzu na ITnetwork.cz, který jsem úspěšně zakončil zkouškou 12.9.2025 v Praze."
        },
        {
        "title": "Reference a doporučení - ukázky",
        "content": "Některé ukázky mé práce jsou dostupné na Git jako public <a href='https://github.com/JaromirIhln'>GitHub <span class='fa fa-github'></span></a> &#128512;.Věnuji se vývoji aplikací v C# ASP.NET (MVC, Blazor, Razor...). V již zmíněném kurzu jsem rozšířil své dovednosti v oblasti webového vývoje, práce a vývoj API a databázových systémů. Na mém GitHubu najdete mimo jiné i nasazený projekt na 'Heroku' -> Heroku-space, který je plně funkční a skládá se z ASP.NET Core API(backend) a .NET MAUI Blazor Hybrid app jako frontend sestavený pro Android. Poslední co  stojí za zmínku je má první publikace dvou rozšíření pro Visual Studio Code na <a href='https://marketplace.visualstudio.com/publishers/JaromrIhln'>Visual Studio Marketplace <span class='fa fa-globe'> </span></a>. Kde už za týden mám 30 stažení Apps Script Syntax Colors (gas) by Jaromir Ihln a 4x JaromirIhln Bootstrap 5.3.7 Snippets, která obsahuje hned několik zajímavých úryvků(snippetů), které lze kombinovat do pně funkční stránky - snippety obsahují i reálné odkazy na média, aby to nebylo tak nezáživné - více na <a href='https://www.jiwebmaster.cz/cs/vsce-extension/apps-script-syntax-colors-gas'>JIWebmaster <span class='fa fa-globe'> </span></a> kde naleznete více &#128526;."
        },
        {
        "title": "Nějaký další obsah pro zábavu.",
        "content": "Jak jsem slíbil zde jsou nějaké odkazy na takové maličkosti - Testy:<a href='https://mypage.jaraweb.cz/learn/index.html'>Testy <span class='fa fa-book'> </span></a> &#128512;. \n Psaní všemi deseti:<a href='https://mypage.jaraweb.cz/learn/all_then.html'>Psaní všemi deseti <span class='fa fa-keyboard-o'></span></a> &#128512;. &#128512;. Všechny odkazy směřují na můj web(subdomény)."
        }    
    ]
}